package com.javarush.test.level03.lesson04.task01;

/* Дата рождения
Вывести на экран дату своего рождения в виде: MAY 1 2012
*/

public class Solution
{
    public static void main(String[] args)
    {
        //напишите тут ваш код
        int year = 1994;
        String month = "SEPTEMBER";
        int day = 1;

        System.out.print(month+" "+day+' '+year);
    }
}